using System.Collections.Generic;

public class SensorModels
    // Здесь хранятся списки моделей датчиков
{
    public List<string> Models_EnI100       { get; set; }
    public List<string> Models_EnI12        { get; set; }
    public List<string> Models_EnI12_M      { get; set; }
    public List<string> Models_NoneSelected { get; set; }

    public SensorModels()
    {
        Models_EnI100   = new List<string>
        {
            "2041",
            "2051",
            "2056",
            "2060",
            "2061",
            "2066",
            "2076",
            "2081",
            "2110",
            "2112",
            "2120",
            "2130",
            "2131",
            "2140",
            "2141",
            "2150",
            "2151",
            "2152",
            "2156",
            "2159",
            "2160",
            "2161",
            "2162",
            "2166",
            "2169",
            "2176",
            "2181",
            "2210",
            "2212",
            "2220",
            "2230",
            "2231",
            "2240",
            "2310",
            "2312",
            "2320",
            "2330",
            "2340",
            "2341",
            "2351",
            "2356",
            "2359",
            "2361",
            "2410",
            "2412",
            "2420",
            "2430",
            "2434",
            "2440",
            "2444",
            "2450",
            "2460",
            "2530",
            "2540",
            "2035K",
            "2038K",
            "2040K",
            "2040M",
            "2050K",
            "2050M",
            "2051K",
            "2056K",
            "2056M",
            "2060K",
            "2060M",
            "2066K",
            "2066M",
            "2120K",
            "2130K",
            "2135K",
            "2138K",
            "2140K",
            "2140M",
            "2150K",
            "2150M",
            "2156K",
            "2156M",
            "2160K",
            "2160M",
            "2166K",
            "2166M",
            "2320К",
            "2330K",
            "2235K",
            "2335K",
            "2338K",
            "2340K",
            "2340M",
            "2350K",
            "2350M",
            "2356K",
            "2356M",
            "2360K",
            "2360M"
        };

        Models_EnI12    = new List<string>
        {
            "2036",
            "2038",
            "2041",
            "2051",
            "2056",
            "2061",
            "2121",
            "2131",
            "2136",
            "2138",
            "2141",
            "2150",
            "2151",
            "2156",
            "2161",
            "2166",
            "2171",
            "2176",
            "2231",
            "2236",
            "2331",
            "2336",
            "2338",
            "2341",
            "2351",
            "2356",
            "2361",
            "2420",
            "2430",
            "2435",
            "2440",
            "2445",
            "2450",
            "2530",
            "2540",
            "2140M",
            "2150M",
            "2156M",
            "2160M",
            "2166M",
            "2340M",
            "2350M",
            "2356M",
            "2360M"
        };

        Models_EnI12_M  = new List<string> 
        {
            "100",
            "400",
            "600",
            "1600",
            "2500",
            "10000",
            "16000",
            "25000",
            "60000"
        };

        Models_NoneSelected = new List<string>()
        {
            "Не указано"
        };
    }

    public List<string> EnI100_Models()
    {
        return Models_EnI100;
    }

    public List<string> EnI12_Models()
    {
        return Models_EnI12;
    }

    public List<string> EnI12M_Models()
    {
        return Models_EnI12_M;
    }
}
